<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />

    <link href="../resources/css/signup.css" rel="stylesheet" />
<!--     <link href="../resources/css/actibuddy.css" rel="stylesheet" />
 -->    <script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
 <link href="${ pageContext.servletContext.contextPath }/resources/css/actibuddy.css" rel="stylesheet" />

    <title>main</title>
  </head>
  
  
  <body>
  
  
    <main class="wrapper">
      <div>
        <img src="../resources/image/actibuddylogo.png" class="mainlogo" />
      </div>
      
      
      
      <div class="signup">
      
      
          <div class="signup6">
            <input type="checkbox" id="chk_all">
            <div class="signup6_2">
             <label for="chk_all">액티버디 이용약관, 개인정보 수집 및 이용, <br>위치정보
             이용약관(선택), 프로모션 정보 수신(선택)에 모두 동의합니다.
            </div>
          </div>

           <div style="height: 80px ;"></div>  <!--코드가 왜 겹쳐져있는지 모르겠네...-->
          <div class="signup2">
            <input type="checkbox" name="chk1" />
            <span
              >액티버디 이용약관 동의
              <span>(필수)</span>
            </span>
            <div class="text">
              <h3 class="article__title">여러분을 환영합니다.</h3>
              <p>
                액티버디 서비스 및 제품(이하 ‘서비스’)을 이용해 주셔서 감사합니다.
                본 약관은 다양한 액티버디 서비스의 이용과 관련하여 액티버디 서비스를 제공하는 액티버디 주식회사(이하 ‘액티버디’)와
                이를 이용하는 액티버디 서비스 회원(이하 ‘회원’) 또는 비회원과의 관계를 설명하며,
                아울러 여러분의 액티버디 서비스 이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다.
            </p>
            <p>
              액티버디 서비스를 이용하시거나 액티버디 서비스 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로,
              잠시 시간을 내시어 주의 깊게 살펴봐 주시기 바랍니다.
          </p>
          <h3 class="article__title">다양한 액티버디 서비스를 즐겨보세요.</h3>
            <p>을 비롯한 액티버디 도메인의 웹사이트 및 응용프로그램(어플리케이션, 앱)을 통해 정보 검색,
              다른 이용자와의 커뮤니케이션, 콘텐츠 제공, 상품 쇼핑 등 여러분의 생활에 편리함을 더할 수 있는 다양한 서비스를 제공하고 있습니다.</p>

            <p>
              여러분은 PC, 휴대폰 등 인터넷 이용이 가능한 각종 단말기를 통해 각양각색의 액티버디 서비스를 자유롭게 이용하실 수 있으며,
              개별 서비스들의 구체적인 내용은 각 서비스 상의 안내, 공지사항, </p>
            <p>
              액티버디는 기본적으로 여러분 모두에게 동일한 내용의 서비스를 제공합니다.
              다만, '청소년보호법' 등 관련 법령이나 기타 개별 서비스 제공에서의 특별한 필요에 의해서 연령 또는 일정한 등급을 기준으로 이용자를 구분하여 제공하는 서비스의 내용, 이용 시간, 이용 횟수 등을 다르게 하는 등 일부 이용을 제한하는 경우가 있습니다.
              자세한 내용은 역시 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등에서 확인하실 수 있습니다.
          </p>
            <p>
              액티버디 서비스에는 기본적으로 본 약관이 적용됩니다만 액티버디가 다양한 서비스를 제공하는 과정에서 부득이 본 약관 외 별도의 약관, 운영정책 등을 적용하는 경우(예, 액티버디페이, V LIVE 등)가 있습니다.
              그리고 액티버디 계열사가 제공하는 특정 서비스의 경우에도(예, LINE, SNOW등) 해당 운영 회사가 정한 고유의 약관, 운영정책 등이 적용될 수 있습니다.
              이러한 내용은 각각의 해당 서비스 초기 화면에서 확인해 주시기 바랍니다.
          </p>
            <p>
              여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며,
              액티버디는 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 액티버디 서비스 이용 계정(이하 ‘계정’)을 부여합니다.
              계정이란 회원이 액티버디 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다.
              회원은 자신의 계정을 통해 좀더 다양한 액티버디 서비스를 보다 편리하게 이용할 수 있습니다.
              이와 관련한 상세한 내용은 </p>
           </div>
          </div>

          <div class="signup2">
            <input type="checkbox" name="chk2" />
            <span
              >개인정보 수집 및 이용 동의
              <span>(필수)</span>
            </span>
            <div class="text">
              <h3 class="article__title">여러분을 환영합니다.</h3>
              <p>
                액티버디 서비스 및 제품(이하 ‘서비스’)을 이용해 주셔서 감사합니다.
                본 약관은 다양한 액티버디 서비스의 이용과 관련하여 액티버디 서비스를 제공하는 액티버디 주식회사(이하 ‘액티버디’)와
                이를 이용하는 액티버디 서비스 회원(이하 ‘회원’) 또는 비회원과의 관계를 설명하며,
                아울러 여러분의 액티버디 서비스 이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다.
            </p>
            <p>
              액티버디 서비스를 이용하시거나 액티버디 서비스 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로,
              잠시 시간을 내시어 주의 깊게 살펴봐 주시기 바랍니다.
          </p>
          <h3 class="article__title">다양한 액티버디 서비스를 즐겨보세요.</h3>
            <p>을 비롯한 액티버디 도메인의 웹사이트 및 응용프로그램(어플리케이션, 앱)을 통해 정보 검색,
              다른 이용자와의 커뮤니케이션, 콘텐츠 제공, 상품 쇼핑 등 여러분의 생활에 편리함을 더할 수 있는 다양한 서비스를 제공하고 있습니다.</p>

            <p>
              여러분은 PC, 휴대폰 등 인터넷 이용이 가능한 각종 단말기를 통해 각양각색의 액티버디 서비스를 자유롭게 이용하실 수 있으며,
              개별 서비스들의 구체적인 내용은 각 서비스 상의 안내, 공지사항, </p>
            <p>
              액티버디는 기본적으로 여러분 모두에게 동일한 내용의 서비스를 제공합니다.
              다만, '청소년보호법' 등 관련 법령이나 기타 개별 서비스 제공에서의 특별한 필요에 의해서 연령 또는 일정한 등급을 기준으로 이용자를 구분하여 제공하는 서비스의 내용, 이용 시간, 이용 횟수 등을 다르게 하는 등 일부 이용을 제한하는 경우가 있습니다.
              자세한 내용은 역시 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등에서 확인하실 수 있습니다.
          </p>
            <p>
              액티버디 서비스에는 기본적으로 본 약관이 적용됩니다만 액티버디가 다양한 서비스를 제공하는 과정에서 부득이 본 약관 외 별도의 약관, 운영정책 등을 적용하는 경우(예, 액티버디페이, V LIVE 등)가 있습니다.
              그리고 액티버디 계열사가 제공하는 특정 서비스의 경우에도(예, LINE, SNOW등) 해당 운영 회사가 정한 고유의 약관, 운영정책 등이 적용될 수 있습니다.
              이러한 내용은 각각의 해당 서비스 초기 화면에서 확인해 주시기 바랍니다.
          </p>
            <p>
              여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며,
              액티버디는 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 액티버디 서비스 이용 계정(이하 ‘계정’)을 부여합니다.
              계정이란 회원이 액티버디 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다.
              회원은 자신의 계정을 통해 좀더 다양한 액티버디 서비스를 보다 편리하게 이용할 수 있습니다.
              이와 관련한 상세한 내용은 </p>
           </div>
          </div>
          <div class="signup2">
            <input type="checkbox"  name="chk"/>
            <span
              >위치정보 이용약관 동의
              <span>(선택)</span>
            </span>
            <div class="text">
              <h3 class="article__title">여러분을 환영합니다.</h3>
              <p>
                액티버디 서비스 및 제품(이하 ‘서비스’)을 이용해 주셔서 감사합니다.
                본 약관은 다양한 액티버디 서비스의 이용과 관련하여 액티버디 서비스를 제공하는 액티버디 주식회사(이하 ‘액티버디’)와
                이를 이용하는 액티버디 서비스 회원(이하 ‘회원’) 또는 비회원과의 관계를 설명하며,
                아울러 여러분의 액티버디 서비스 이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다.
            </p>
            <p>
              액티버디 서비스를 이용하시거나 액티버디 서비스 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로,
              잠시 시간을 내시어 주의 깊게 살펴봐 주시기 바랍니다.
          </p>
          <h3 class="article__title">다양한 액티버디 서비스를 즐겨보세요.</h3>
            <p>을 비롯한 액티버디 도메인의 웹사이트 및 응용프로그램(어플리케이션, 앱)을 통해 정보 검색,
              다른 이용자와의 커뮤니케이션, 콘텐츠 제공, 상품 쇼핑 등 여러분의 생활에 편리함을 더할 수 있는 다양한 서비스를 제공하고 있습니다.</p>

            <p>
              여러분은 PC, 휴대폰 등 인터넷 이용이 가능한 각종 단말기를 통해 각양각색의 액티버디 서비스를 자유롭게 이용하실 수 있으며,
              개별 서비스들의 구체적인 내용은 각 서비스 상의 안내, 공지사항, </p>
            <p>
              액티버디는 기본적으로 여러분 모두에게 동일한 내용의 서비스를 제공합니다.
              다만, '청소년보호법' 등 관련 법령이나 기타 개별 서비스 제공에서의 특별한 필요에 의해서 연령 또는 일정한 등급을 기준으로 이용자를 구분하여 제공하는 서비스의 내용, 이용 시간, 이용 횟수 등을 다르게 하는 등 일부 이용을 제한하는 경우가 있습니다.
              자세한 내용은 역시 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등에서 확인하실 수 있습니다.
          </p>
            <p>
              액티버디 서비스에는 기본적으로 본 약관이 적용됩니다만 액티버디가 다양한 서비스를 제공하는 과정에서 부득이 본 약관 외 별도의 약관, 운영정책 등을 적용하는 경우(예, 액티버디페이, V LIVE 등)가 있습니다.
              그리고 액티버디 계열사가 제공하는 특정 서비스의 경우에도(예, LINE, SNOW등) 해당 운영 회사가 정한 고유의 약관, 운영정책 등이 적용될 수 있습니다.
              이러한 내용은 각각의 해당 서비스 초기 화면에서 확인해 주시기 바랍니다.
          </p>
            <p>
              여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며,
              액티버디는 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 액티버디 서비스 이용 계정(이하 ‘계정’)을 부여합니다.
              계정이란 회원이 액티버디 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다.
              회원은 자신의 계정을 통해 좀더 다양한 액티버디 서비스를 보다 편리하게 이용할 수 있습니다.
              이와 관련한 상세한 내용은 </p>
           </div>
          </div>
          <div class="signup2">
            <input type="checkbox" name="chk"/>
            <span
              >프로모션 정보수신 동의
              <span>(선택)</span>
            </span>
            <div class="text">
              <h3 class="article__title">여러분을 환영합니다.</h3>
              <p>
                액티버디 서비스 및 제품(이하 ‘서비스’)을 이용해 주셔서 감사합니다.
                본 약관은 다양한 액티버디 서비스의 이용과 관련하여 액티버디 서비스를 제공하는 액티버디 주식회사(이하 ‘액티버디’)와
                이를 이용하는 액티버디 서비스 회원(이하 ‘회원’) 또는 비회원과의 관계를 설명하며,
                아울러 여러분의 액티버디 서비스 이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다.
            </p>
            <p>
              액티버디 서비스를 이용하시거나 액티버디 서비스 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로,
              잠시 시간을 내시어 주의 깊게 살펴봐 주시기 바랍니다.
          </p>
          <h3 class="article__title">다양한 액티버디 서비스를 즐겨보세요.</h3>
            <p>을 비롯한 액티버디 도메인의 웹사이트 및 응용프로그램(어플리케이션, 앱)을 통해 정보 검색,
              다른 이용자와의 커뮤니케이션, 콘텐츠 제공, 상품 쇼핑 등 여러분의 생활에 편리함을 더할 수 있는 다양한 서비스를 제공하고 있습니다.</p>

            <p>
              여러분은 PC, 휴대폰 등 인터넷 이용이 가능한 각종 단말기를 통해 각양각색의 액티버디 서비스를 자유롭게 이용하실 수 있으며,
              개별 서비스들의 구체적인 내용은 각 서비스 상의 안내, 공지사항, </p>
            <p>
              액티버디는 기본적으로 여러분 모두에게 동일한 내용의 서비스를 제공합니다.
              다만, '청소년보호법' 등 관련 법령이나 기타 개별 서비스 제공에서의 특별한 필요에 의해서 연령 또는 일정한 등급을 기준으로 이용자를 구분하여 제공하는 서비스의 내용, 이용 시간, 이용 횟수 등을 다르게 하는 등 일부 이용을 제한하는 경우가 있습니다.
              자세한 내용은 역시 각 서비스 상의 안내, 공지사항, 고객센터 도움말 등에서 확인하실 수 있습니다.
          </p>
            <p>
              액티버디 서비스에는 기본적으로 본 약관이 적용됩니다만 액티버디가 다양한 서비스를 제공하는 과정에서 부득이 본 약관 외 별도의 약관, 운영정책 등을 적용하는 경우(예, 액티버디페이, V LIVE 등)가 있습니다.
              그리고 액티버디 계열사가 제공하는 특정 서비스의 경우에도(예, LINE, SNOW등) 해당 운영 회사가 정한 고유의 약관, 운영정책 등이 적용될 수 있습니다.
              이러한 내용은 각각의 해당 서비스 초기 화면에서 확인해 주시기 바랍니다.
          </p>
            <p>
              여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며,
              액티버디는 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 액티버디 서비스 이용 계정(이하 ‘계정’)을 부여합니다.
              계정이란 회원이 액티버디 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다.
              회원은 자신의 계정을 통해 좀더 다양한 액티버디 서비스를 보다 편리하게 이용할 수 있습니다.
              이와 관련한 상세한 내용은 </p>
           </div>
          </div>

           <script>
          $( document ).ready( function() {
            $( '#chk_all' ).click( function() {
              if($("#chk_all").prop("checked")){
                $("input[name=chk1]").prop("checked",true);
                $("input[name=chk2]").prop("checked",true);
                $("input[name=chk]").prop("checked",true);
        }else{
          $("input[name=chk1]").prop("checked",false);
          $("input[name=chk2]").prop("checked",false);
          $("input[name=chk]").prop("checked",false);
        }

            });
            
            $('.but').click(function(){
                  if(
                    (($("input[name=chk1]").prop("checked") == true)  &&  ($("input[name=chk2]").prop("checked") == true)) 
                    && (($("input[name=chk]").prop("checked") == true) || ($("input[name=chk]").prop("checked") == false))) {
                	  
                	  $(location).attr('href','${ pageContext.servletContext.contextPath }/member/loging');

                  }
                    else{
                      alert("필수 항목에 체크해주세요!");
/*                       event.stopPropagation();
 */                }
            });
          });
        </script>

          <div class="signup3"><a href="${ pageContext.servletContext.contextPath }"><button class="but1">취소</button></a></div>
          <div class="signup4"><button class="but">확인</button></div>
        
        </div>
        <div style="height=300px">
        
        </div>
  	 <jsp:include page="../common/footer.jsp"/>
  	 
    </main>
  </body>
</html>
